{
  "when should I plant rice": "Plant rice during monsoon season, usually June to July.",
  "best time to grow rice": "June to July is best for planting rice.",
  "how to plant rice": "First plough the land, then transplant young rice plants into wet soil.",
  "rice planting": "Start planting rice in early monsoon. Keep soil wet.",
  
  "how to control pests in crops": "Use neem oil, cow urine spray, or approved organic pesticides.",
  "pest control for crops": "Spray neem-based solution early morning or evening to control pests.",
  "insect problem in plants": "Spray neem or garlic-chili mix. Rotate crops to reduce insects.",

  "best fertilizer for tomatoes": "Use compost, cow dung, and NPK 10:10:10 fertilizer for tomatoes.",
  "tomato plant nutrition": "Feed tomatoes every 2 weeks with organic compost or liquid fertilizer.",
  "how to grow healthy tomatoes": "Give enough sun, water regularly, and use mulch.",

  "how to take care of cows": "Feed cows green grass, clean water, and give regular vaccinations.",
  "cow and goat care tips": "Give shelter, regular feed, clean space, and check health often.",
  "vaccination schedule for cows": "First vaccine at 3 months, then follow vet’s advice yearly.",

  "government schemes for farmers": "PM-Kisan, Rythu Bandhu, and crop insurance are available schemes.",
  "how to get farmer schemes": "Visit local agriculture office or online PM-Kisan portal.",
  "subsidy for seeds": "Government gives subsidy for certified seeds. Ask your agriculture officer.",

  "how to grow chillies": "Use well-drained soil. Start in hot season, and water regularly.",
  "chilli crop care": "Use potassium-rich fertilizer and protect from aphids.",
  "fertilizer for chillies": "Use cow dung, compost, and potassium-based fertilizers.",

  "how to grow onions": "Plant in winter. Keep soil loose and water regularly.",
  "onion farming tips": "Avoid water stagnation. Use phosphorus fertilizer.",
  "disease in onions": "Use fungicide and rotate crops to avoid fungal infection.",

  "best fertilizer for sugarcane": "Use compost and nitrogen-rich fertilizer during early growth.",
  "how to plant sugarcane": "Cut seed pieces with buds and plant horizontally in rows.",
  "sugarcane watering": "Water weekly. More in summer, less in rainy season.",

  "how to save water in farming": "Use drip irrigation and mulch to save water.",
  "drip irrigation benefits": "Saves water and gives better crop yield.",
  "rainwater harvesting for farms": "Build small tanks or bunds to collect rainwater.",

  "what is vermicompost": "Fertilizer made from earthworms and waste. Very good for soil.",
  "benefits of vermicompost": "Improves soil and gives healthy crop.",
  "how to make vermicompost": "Use a pit or bin, add kitchen waste and cow dung. Keep moist.",

  "soil testing importance": "Tells which fertilizer to use for best crop.",
  "where to test soil": "Visit agriculture office or nearest Krishi Vignan Kendra.",
  "soil pH for crops": "Most crops grow best in pH 6 to 7.",

  "crop rotation benefits": "Prevents pests and increases soil fertility.",
  "why rotate crops": "Stops diseases and gives better yield.",
  "examples of crop rotation": "Grow rice, then legumes like green gram or black gram.",

  "how to prevent crop diseases": "Use clean seeds, rotate crops, and use organic sprays.",
  "organic farming benefits": "Safe food, better soil health, and long-term gain.",
  "how to start organic farming": "Avoid chemicals. Use compost and local seeds.",

  "market price of crops": "Check local mandi or use mobile apps like Kisan Suvidha.",
  "how to sell crops online": "Use eNAM or call local mandi officer for help.",
  "crop insurance benefits": "Protects your crop from damage due to weather or pests.",

  "weather tips for farming": "Check daily forecast. Avoid spraying before rain.",
  "how to protect crops from rain": "Build bunds and cover young plants with plastic sheets.",
  "farming help number": "Call Kisan Call Centre: 1800-180-1551 for free advice."
}
